## Q1. List any five functions of the pandas library with execution.

In [3]:
import pandas as pd

1] head()
2] describe()
3] sort_values()
4] isnull()
5] unique()

In [6]:
pip install scikit-learn

Requirement already satisfied: scikit-learn in c:\users\wwwha\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: numpy>=1.19.5 in c:\users\wwwha\anaconda3\lib\site-packages (from scikit-learn) (1.26.4)
Requirement already satisfied: scipy>=1.6.0 in c:\users\wwwha\anaconda3\lib\site-packages (from scikit-learn) (1.13.1)
Requirement already satisfied: joblib>=1.2.0 in c:\users\wwwha\anaconda3\lib\site-packages (from scikit-learn) (1.4.2)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\wwwha\anaconda3\lib\site-packages (from scikit-learn) (2.2.0)
Note: you may need to restart the kernel to use updated packages.

In [7]:
from sklearn.datasets import load_iris

In [8]:
iris = load_iris()

In [9]:
df = pd.DataFrame(iris.data,columns = iris.feature_names)

In [10]:
df.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [11]:
df.describe()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.057333,3.758000,1.199333
std,0.828066,0.435866,1.765298,0.762238
min,4.300000,2.000000,1.000000,0.100000
25%,5.100000,2.800000,1.600000,0.300000
50%,5.800000,3.000000,4.350000,1.300000
75%,6.400000,3.300000,5.100000,1.800000
max,7.900000,4.400000,6.900000,2.500000

In [24]:
df

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

In [28]:
df['sepal length (cm)'].unique()

array([5.1, 4.9, 4.7, 4.6, 5. , 5.4, 4.4, 4.8, 4.3, 5.8, 5.7, 5.2, 5.5,
       4.5, 5.3, 7. , 6.4, 6.9, 6.5, 6.3, 6.6, 5.9, 6. , 6.1, 5.6, 6.7,
       6.2, 6.8, 7.1, 7.6, 7.3, 7.2, 7.7, 7.4, 7.9])

In [32]:
df.isnull().sum()

sepal length (cm)    0
sepal width (cm)     0
petal length (cm)    0
petal width (cm)     0
dtype: int64

In [34]:
df.sort_values('sepal length (cm)')

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
13                 4.3               3.0                1.1               0.1
42                 4.4               3.2                1.3               0.2
38                 4.4               3.0                1.3               0.2
8                  4.4               2.9                1.4               0.2
41                 4.5               2.3                1.3               0.3
..                 ...               ...                ...               ...
122                7.7               2.8                6.7               2.0
118                7.7               2.6                6.9               2.3
117                7.7               3.8                6.7               2.2
135                7.7               3.0                6.1               2.3
131                7.9               3.8                6.4               2.0

[150 rows x 4 columns]

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [262]:
df2 = pd.DataFrame({'A':[1,2,3,4],
                    'B':[5,6,7,8],
                    'C':[9,10,11,12]
})

In [264]:
df2

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [269]:
new_index = range(1,2*len(df2)+1,2)

In [271]:
df_reindexed = df2.set_index(pd.Index(new_index))

In [273]:
df_reindexed

   A  B   C
1  1  5   9
3  2  6  10
5  3  7  11
7  4  8  12

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console

In [46]:
dict = {
    'values':[1,2,3,4,5,6,7,8,9]
}

In [48]:
data = pd.DataFrame(dict)

In [50]:
data

   values
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9

In [136]:
sum = 0 
for i in data[['values']].head(3).iterrows():
    sum = sum + i[1]

In [138]:
sum

values    6
dtype: int64

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [216]:
data3 = {'Text':['Hi i am harshal','Hi i love chess and volleyball']}

In [218]:
df5 = pd.DataFrame(data3)

In [220]:
df5

                             Text
0                 Hi i am harshal
1  Hi i love chess and volleyball

In [240]:
def word_count(x):
    a = len(x.split())
    return a

In [242]:
df5['Word_count'] = df5['Text'].apply(word_count)

In [244]:
df5

                             Text  Word_count
0                 Hi i am harshal           4
1  Hi i love chess and volleyball           6

## Q5. How are DataFrame.size() and DataFrame.shape() different?

1] DataFrame.size():  Returns the total number of elements in the DataFrame.
2] DataFrame.shape(): Returns a tuple represnting the no. of rows and the number of colmns.

## Q6. Which function of pandas do we use to read an excel file?

pd.read_excel()   ## This function is used to read an excel sheet

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [246]:
def email_address(x):
    a = x.split('@')
    b = a[0]
    return b

In [248]:
email_address('me21b060@smail.iitm.ac.in')

'me21b060'

In [256]:
df6 =pd.DataFrame( {'Email':['me21b060@smail.iitm.ac.in','john.doe@example.com','username@domain.com']})

In [258]:
df6['Username'] = df6['Email'].apply(email_address)

In [260]:
df6

                       Email  Username
0  me21b060@smail.iitm.ac.in  me21b060
1       john.doe@example.com  john.doe
2        username@domain.com  username

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [80]:
data3 = {
    'A': [1,2,3,4,5,6,7,8,9],
    'B': [5,6,8,9,7,6,7,8,9],
    'C': [1,2,3,4,5,6,7,8,9]
}

In [82]:
df3 = pd.DataFrame(data3)

In [94]:
df3['A'] > 5

0    False
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
Name: A, dtype: bool

In [96]:
df3['B'] <10

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
Name: B, dtype: bool

In [106]:
df3[(df3['A'] > 5) & (df3['B'] <10)]

   A  B  C
5  6  6  6
6  7  7  7
7  8  8  8
8  9  9  9

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [56]:
dict = {
    'values':[1,2,3,4,5,6,7,8,9]
}

In [58]:
data2 = pd.DataFrame(dict)

In [60]:
data2

   values
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9

In [62]:
data2['values'].mean()

5.0

In [64]:
data2['values'].median()

5.0

In [66]:
data2['values'].std()

2.7386127875258306

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [276]:
data = {
    'Date': ['2024-10-01', '2024-10-02', '2024-10-03', '2024-10-04', 
             '2024-10-05', '2024-10-06', '2024-10-07', '2024-10-08', 
             '2024-10-09', '2024-10-10'],
    'Sales': [100, 150, 200, 250, 300, 350, 400, 450, 500, 550]
}
df = pd.DataFrame(data)

In [278]:
df

         Date  Sales
0  2024-10-01    100
1  2024-10-02    150
2  2024-10-03    200
3  2024-10-04    250
4  2024-10-05    300
5  2024-10-06    350
6  2024-10-07    400
7  2024-10-08    450
8  2024-10-09    500
9  2024-10-10    550

In [284]:
df['Sales'].rolling(window = 7 ).mean()

0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
5      NaN
6    250.0
7    300.0
8    350.0
9    400.0
Name: Sales, dtype: float64

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [314]:
df4 = pd.DataFrame(df4)

In [316]:
df4.drop(columns = 'Date',inplace=True)

In [328]:
df4.rename(columns ={0:'Date'} )

          Date    Weekday
0   2023-01-01    Tuesday
1   2023-01-02  Wednesday
2   2023-01-03   Thursday
3   2023-01-04     Friday
4   2023-01-05   Saturday
..         ...        ...
360 2023-12-27        NaN
361 2023-12-28        NaN
362 2023-12-29        NaN
363 2023-12-30        NaN
364 2023-12-31        NaN

[365 rows x 2 columns]

In [ ]:
df4['Date'] = pd.to_datetime(df4['Date'])

In [ ]:
df4['Weekday'] = df4['Date'].dt.day_name()

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [142]:
df4 = pd.date_range(start = '2023-01-01',end = '2023-12-31')

In [150]:
df4

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10',
               ...
               '2023-12-22', '2023-12-23', '2023-12-24', '2023-12-25',
               '2023-12-26', '2023-12-27', '2023-12-28', '2023-12-29',
               '2023-12-30', '2023-12-31'],
              dtype='datetime64[ns]', length=365, freq='D')

In [160]:
df4[df4.month == 1]

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20',
               '2023-01-21', '2023-01-22', '2023-01-23', '2023-01-24',
               '2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31'],
              dtype='datetime64[ns]', freq='D')

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

1] Pandas library needs to be imported
import pandas as pd
pd can be use as a alias